earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# Degz Robotics Suibo RP2040
# -----------------------------------
degz_suibo.name=Degz Robotics Suibo RP2040
degz_suibo.vid.0=0x2e8a
degz_suibo.pid.0=0xf00a
degz_suibo.vid.1=0x2e8a
degz_suibo.pid.1=0xf10a
degz_suibo.vid.2=0x2e8a
degz_suibo.pid.2=0xf00a
degz_suibo.vid.3=0x2e8a
degz_suibo.pid.3=0xf10a
degz_suibo.vid.4=0x2e8a
degz_suibo.pid.4=0xf00a
degz_suibo.vid.5=0x2e8a
degz_suibo.pid.5=0xf10a
degz_suibo.vid.6=0x2e8a
degz_suibo.pid.6=0xf00a
degz_suibo.vid.7=0x2e8a
degz_suibo.pid.7=0xf10a
degz_suibo.build.usbvid=-DUSBD_VID=0x2e8a
degz_suibo.build.usbpid=-DUSBD_PID=0xf00a
degz_suibo.build.usbpwr=-DUSBD_MAX_POWER_MA=250
degz_suibo.build.board=DEGZ_SUIBO_RP2040
degz_suibo.build.mcu=cortex-m0plus
degz_suibo.build.variant=degz_suibo
degz_suibo.upload.maximum_size=16777216
degz_suibo.upload.wait_for_upload_port=true
degz_suibo.upload.erase_cmd=
degz_suibo.serial.disableDTR=false
degz_suibo.serial.disableRTS=false
degz_suibo.build.f_cpu=125000000
degz_suibo.build.led=
degz_suibo.build.core=rp2040
degz_suibo.build.ldscript=memmap_default.ld
degz_suibo.build.boot2=boot2_generic_03h_4_padded_checksum
degz_suibo.build.usb_manufacturer="Degz Robotics"
degz_suibo.build.usb_product="Suibo RP2040"
degz_suibo.menu.flash.16777216_0=16MB (no FS)
degz_suibo.menu.flash.16777216_0.upload.maximum_size=16773120
degz_suibo.menu.flash.16777216_0.build.flash_total=16777216
degz_suibo.menu.flash.16777216_0.build.flash_length=16773120
degz_suibo.menu.flash.16777216_0.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_0.build.fs_start=285208576
degz_suibo.menu.flash.16777216_0.build.fs_end=285208576
degz_suibo.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
degz_suibo.menu.flash.16777216_65536.upload.maximum_size=16707584
degz_suibo.menu.flash.16777216_65536.build.flash_total=16777216
degz_suibo.menu.flash.16777216_65536.build.flash_length=16707584
degz_suibo.menu.flash.16777216_65536.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_65536.build.fs_start=285143040
degz_suibo.menu.flash.16777216_65536.build.fs_end=285208576
degz_suibo.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
degz_suibo.menu.flash.16777216_131072.upload.maximum_size=16642048
degz_suibo.menu.flash.16777216_131072.build.flash_total=16777216
degz_suibo.menu.flash.16777216_131072.build.flash_length=16642048
degz_suibo.menu.flash.16777216_131072.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_131072.build.fs_start=285077504
degz_suibo.menu.flash.16777216_131072.build.fs_end=285208576
degz_suibo.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
degz_suibo.menu.flash.16777216_262144.upload.maximum_size=16510976
degz_suibo.menu.flash.16777216_262144.build.flash_total=16777216
degz_suibo.menu.flash.16777216_262144.build.flash_length=16510976
degz_suibo.menu.flash.16777216_262144.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_262144.build.fs_start=284946432
degz_suibo.menu.flash.16777216_262144.build.fs_end=285208576
degz_suibo.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
degz_suibo.menu.flash.16777216_524288.upload.maximum_size=16248832
degz_suibo.menu.flash.16777216_524288.build.flash_total=16777216
degz_suibo.menu.flash.16777216_524288.build.flash_length=16248832
degz_suibo.menu.flash.16777216_524288.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_524288.build.fs_start=284684288
degz_suibo.menu.flash.16777216_524288.build.fs_end=285208576
degz_suibo.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
degz_suibo.menu.flash.16777216_1048576.upload.maximum_size=15724544
degz_suibo.menu.flash.16777216_1048576.build.flash_total=16777216
degz_suibo.menu.flash.16777216_1048576.build.flash_length=15724544
degz_suibo.menu.flash.16777216_1048576.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_1048576.build.fs_start=284160000
degz_suibo.menu.flash.16777216_1048576.build.fs_end=285208576
degz_suibo.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
degz_suibo.menu.flash.16777216_2097152.upload.maximum_size=14675968
degz_suibo.menu.flash.16777216_2097152.build.flash_total=16777216
degz_suibo.menu.flash.16777216_2097152.build.flash_length=14675968
degz_suibo.menu.flash.16777216_2097152.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_2097152.build.fs_start=283111424
degz_suibo.menu.flash.16777216_2097152.build.fs_end=285208576
degz_suibo.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
degz_suibo.menu.flash.16777216_3145728.upload.maximum_size=13627392
degz_suibo.menu.flash.16777216_3145728.build.flash_total=16777216
degz_suibo.menu.flash.16777216_3145728.build.flash_length=13627392
degz_suibo.menu.flash.16777216_3145728.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_3145728.build.fs_start=282062848
degz_suibo.menu.flash.16777216_3145728.build.fs_end=285208576
degz_suibo.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
degz_suibo.menu.flash.16777216_4194304.upload.maximum_size=12578816
degz_suibo.menu.flash.16777216_4194304.build.flash_total=16777216
degz_suibo.menu.flash.16777216_4194304.build.flash_length=12578816
degz_suibo.menu.flash.16777216_4194304.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_4194304.build.fs_start=281014272
degz_suibo.menu.flash.16777216_4194304.build.fs_end=285208576
degz_suibo.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
degz_suibo.menu.flash.16777216_5242880.upload.maximum_size=11530240
degz_suibo.menu.flash.16777216_5242880.build.flash_total=16777216
degz_suibo.menu.flash.16777216_5242880.build.flash_length=11530240
degz_suibo.menu.flash.16777216_5242880.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_5242880.build.fs_start=279965696
degz_suibo.menu.flash.16777216_5242880.build.fs_end=285208576
degz_suibo.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
degz_suibo.menu.flash.16777216_6291456.upload.maximum_size=10481664
degz_suibo.menu.flash.16777216_6291456.build.flash_total=16777216
degz_suibo.menu.flash.16777216_6291456.build.flash_length=10481664
degz_suibo.menu.flash.16777216_6291456.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_6291456.build.fs_start=278917120
degz_suibo.menu.flash.16777216_6291456.build.fs_end=285208576
degz_suibo.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
degz_suibo.menu.flash.16777216_7340032.upload.maximum_size=9433088
degz_suibo.menu.flash.16777216_7340032.build.flash_total=16777216
degz_suibo.menu.flash.16777216_7340032.build.flash_length=9433088
degz_suibo.menu.flash.16777216_7340032.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_7340032.build.fs_start=277868544
degz_suibo.menu.flash.16777216_7340032.build.fs_end=285208576
degz_suibo.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
degz_suibo.menu.flash.16777216_8388608.upload.maximum_size=8384512
degz_suibo.menu.flash.16777216_8388608.build.flash_total=16777216
degz_suibo.menu.flash.16777216_8388608.build.flash_length=8384512
degz_suibo.menu.flash.16777216_8388608.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_8388608.build.fs_start=276819968
degz_suibo.menu.flash.16777216_8388608.build.fs_end=285208576
degz_suibo.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
degz_suibo.menu.flash.16777216_9437184.upload.maximum_size=7335936
degz_suibo.menu.flash.16777216_9437184.build.flash_total=16777216
degz_suibo.menu.flash.16777216_9437184.build.flash_length=7335936
degz_suibo.menu.flash.16777216_9437184.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_9437184.build.fs_start=275771392
degz_suibo.menu.flash.16777216_9437184.build.fs_end=285208576
degz_suibo.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
degz_suibo.menu.flash.16777216_10485760.upload.maximum_size=6287360
degz_suibo.menu.flash.16777216_10485760.build.flash_total=16777216
degz_suibo.menu.flash.16777216_10485760.build.flash_length=6287360
degz_suibo.menu.flash.16777216_10485760.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_10485760.build.fs_start=274722816
degz_suibo.menu.flash.16777216_10485760.build.fs_end=285208576
degz_suibo.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
degz_suibo.menu.flash.16777216_11534336.upload.maximum_size=5238784
degz_suibo.menu.flash.16777216_11534336.build.flash_total=16777216
degz_suibo.menu.flash.16777216_11534336.build.flash_length=5238784
degz_suibo.menu.flash.16777216_11534336.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_11534336.build.fs_start=273674240
degz_suibo.menu.flash.16777216_11534336.build.fs_end=285208576
degz_suibo.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
degz_suibo.menu.flash.16777216_12582912.upload.maximum_size=4190208
degz_suibo.menu.flash.16777216_12582912.build.flash_total=16777216
degz_suibo.menu.flash.16777216_12582912.build.flash_length=4190208
degz_suibo.menu.flash.16777216_12582912.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_12582912.build.fs_start=272625664
degz_suibo.menu.flash.16777216_12582912.build.fs_end=285208576
degz_suibo.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
degz_suibo.menu.flash.16777216_13631488.upload.maximum_size=3141632
degz_suibo.menu.flash.16777216_13631488.build.flash_total=16777216
degz_suibo.menu.flash.16777216_13631488.build.flash_length=3141632
degz_suibo.menu.flash.16777216_13631488.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_13631488.build.fs_start=271577088
degz_suibo.menu.flash.16777216_13631488.build.fs_end=285208576
degz_suibo.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
degz_suibo.menu.flash.16777216_14680064.upload.maximum_size=2093056
degz_suibo.menu.flash.16777216_14680064.build.flash_total=16777216
degz_suibo.menu.flash.16777216_14680064.build.flash_length=2093056
degz_suibo.menu.flash.16777216_14680064.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_14680064.build.fs_start=270528512
degz_suibo.menu.flash.16777216_14680064.build.fs_end=285208576
degz_suibo.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
degz_suibo.menu.flash.16777216_15728640.upload.maximum_size=1044480
degz_suibo.menu.flash.16777216_15728640.build.flash_total=16777216
degz_suibo.menu.flash.16777216_15728640.build.flash_length=1044480
degz_suibo.menu.flash.16777216_15728640.build.eeprom_start=285208576
degz_suibo.menu.flash.16777216_15728640.build.fs_start=269479936
degz_suibo.menu.flash.16777216_15728640.build.fs_end=285208576
degz_suibo.menu.freq.133=133 MHz
degz_suibo.menu.freq.133.build.f_cpu=133000000L
degz_suibo.menu.freq.50=50 MHz
degz_suibo.menu.freq.50.build.f_cpu=50000000L
degz_suibo.menu.freq.100=100 MHz
degz_suibo.menu.freq.100.build.f_cpu=100000000L
degz_suibo.menu.freq.120=120 MHz
degz_suibo.menu.freq.120.build.f_cpu=120000000L
degz_suibo.menu.freq.125=125 MHz
degz_suibo.menu.freq.125.build.f_cpu=125000000L
degz_suibo.menu.freq.150=150 MHz (Overclock)
degz_suibo.menu.freq.150.build.f_cpu=150000000L
degz_suibo.menu.freq.175=175 MHz (Overclock)
degz_suibo.menu.freq.175.build.f_cpu=175000000L
degz_suibo.menu.freq.200=200 MHz (Overclock)
degz_suibo.menu.freq.200.build.f_cpu=200000000L
degz_suibo.menu.freq.225=225 MHz (Overclock)
degz_suibo.menu.freq.225.build.f_cpu=225000000L
degz_suibo.menu.freq.240=240 MHz (Overclock)
degz_suibo.menu.freq.240.build.f_cpu=240000000L
degz_suibo.menu.freq.250=250 MHz (Overclock)
degz_suibo.menu.freq.250.build.f_cpu=250000000L
degz_suibo.menu.freq.275=275 MHz (Overclock)
degz_suibo.menu.freq.275.build.f_cpu=275000000L
degz_suibo.menu.freq.300=300 MHz (Overclock)
degz_suibo.menu.freq.300.build.f_cpu=300000000L
degz_suibo.menu.opt.Small=Small (-Os) (standard)
degz_suibo.menu.opt.Small.build.flags.optimize=-Os
degz_suibo.menu.opt.Optimize=Optimize (-O)
degz_suibo.menu.opt.Optimize.build.flags.optimize=-O
degz_suibo.menu.opt.Optimize2=Optimize More (-O2)
degz_suibo.menu.opt.Optimize2.build.flags.optimize=-O2
degz_suibo.menu.opt.Optimize3=Optimize Even More (-O3)
degz_suibo.menu.opt.Optimize3.build.flags.optimize=-O3
degz_suibo.menu.opt.Fast=Fast (-Ofast) (maybe slower)
degz_suibo.menu.opt.Fast.build.flags.optimize=-Ofast
degz_suibo.menu.opt.Debug=Debug (-Og)
degz_suibo.menu.opt.Debug.build.flags.optimize=-Og
degz_suibo.menu.rtti.Disabled=Disabled
degz_suibo.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
degz_suibo.menu.rtti.Enabled=Enabled
degz_suibo.menu.rtti.Enabled.build.flags.rtti=
degz_suibo.menu.stackprotect.Disabled=Disabled
degz_suibo.menu.stackprotect.Disabled.build.flags.stackprotect=
degz_suibo.menu.stackprotect.Enabled=Enabled
degz_suibo.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
degz_suibo.menu.exceptions.Disabled=Disabled
degz_suibo.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
degz_suibo.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
degz_suibo.menu.exceptions.Enabled=Enabled
degz_suibo.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
degz_suibo.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
degz_suibo.menu.dbgport.Disabled=Disabled
degz_suibo.menu.dbgport.Disabled.build.debug_port=
degz_suibo.menu.dbgport.Serial=Serial
degz_suibo.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
degz_suibo.menu.dbgport.Serial1=Serial1
degz_suibo.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
degz_suibo.menu.dbgport.Serial2=Serial2
degz_suibo.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
degz_suibo.menu.dbglvl.None=None
degz_suibo.menu.dbglvl.None.build.debug_level=
degz_suibo.menu.dbglvl.Core=Core
degz_suibo.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
degz_suibo.menu.dbglvl.SPI=SPI
degz_suibo.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
degz_suibo.menu.dbglvl.Wire=Wire
degz_suibo.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
degz_suibo.menu.dbglvl.Bluetooth=Bluetooth
degz_suibo.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
degz_suibo.menu.dbglvl.All=All
degz_suibo.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
degz_suibo.menu.dbglvl.NDEBUG=NDEBUG
degz_suibo.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
degz_suibo.menu.usbstack.picosdk=Pico SDK
degz_suibo.menu.usbstack.picosdk.build.usbstack_flags=
degz_suibo.menu.usbstack.tinyusb=Adafruit TinyUSB
degz_suibo.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
degz_suibo.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host
degz_suibo.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
degz_suibo.menu.usbstack.nousb=No USB
degz_suibo.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
degz_suibo.menu.ipbtstack.ipv4only=IPv4 Only
degz_suibo.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
degz_suibo.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
degz_suibo.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
degz_suibo.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
degz_suibo.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
degz_suibo.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
degz_suibo.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
degz_suibo.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
degz_suibo.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
degz_suibo.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
degz_suibo.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
degz_suibo.menu.uploadmethod.default=Default (UF2)
degz_suibo.menu.uploadmethod.default.build.ram_length=256k
degz_suibo.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
degz_suibo.menu.uploadmethod.default.upload.maximum_data_size=262144
degz_suibo.menu.uploadmethod.default.upload.tool=uf2conv
degz_suibo.menu.uploadmethod.default.upload.tool.default=uf2conv
degz_suibo.menu.uploadmethod.default.upload.tool.network=uf2conv-network
degz_suibo.menu.uploadmethod.picotool=Picotool
degz_suibo.menu.uploadmethod.picotool.build.ram_length=256k
degz_suibo.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
degz_suibo.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
degz_suibo.menu.uploadmethod.picotool.upload.maximum_data_size=262144
degz_suibo.menu.uploadmethod.picotool.upload.tool=picotool
degz_suibo.menu.uploadmethod.picotool.upload.tool.default=picotool
degz_suibo.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
degz_suibo.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
degz_suibo.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
degz_suibo.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
degz_suibo.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
degz_suibo.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
degz_suibo.menu.uploadmethod.picodebug=Pico-Debug
degz_suibo.menu.uploadmethod.picodebug.build.ram_length=240k
degz_suibo.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
degz_suibo.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
degz_suibo.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
degz_suibo.menu.uploadmethod.picodebug.upload.tool=picodebug
degz_suibo.menu.uploadmethod.picodebug.upload.tool.default=picodebug

