earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# uPesy RP2040 DevKit
# -----------------------------------
upesy_rp2040_devkit.name=uPesy RP2040 DevKit
upesy_rp2040_devkit.vid.0=0x2e8a
upesy_rp2040_devkit.pid.0=0x1007
upesy_rp2040_devkit.vid.1=0x2e8a
upesy_rp2040_devkit.pid.1=0x1107
upesy_rp2040_devkit.vid.2=0x2e8a
upesy_rp2040_devkit.pid.2=0x5007
upesy_rp2040_devkit.vid.3=0x2e8a
upesy_rp2040_devkit.pid.3=0x5107
upesy_rp2040_devkit.vid.4=0x2e8a
upesy_rp2040_devkit.pid.4=0x9007
upesy_rp2040_devkit.vid.5=0x2e8a
upesy_rp2040_devkit.pid.5=0x9107
upesy_rp2040_devkit.vid.6=0x2e8a
upesy_rp2040_devkit.pid.6=0xd007
upesy_rp2040_devkit.vid.7=0x2e8a
upesy_rp2040_devkit.pid.7=0xd107
upesy_rp2040_devkit.build.usbvid=-DUSBD_VID=0x2e8a
upesy_rp2040_devkit.build.usbpid=-DUSBD_PID=0x1007
upesy_rp2040_devkit.build.usbpwr=-DUSBD_MAX_POWER_MA=250
upesy_rp2040_devkit.build.board=UPESY_RP2040_DEVKIT
upesy_rp2040_devkit.build.mcu=cortex-m0plus
upesy_rp2040_devkit.build.variant=upesy_rp2040_devkit
upesy_rp2040_devkit.upload.maximum_size=2097152
upesy_rp2040_devkit.upload.wait_for_upload_port=true
upesy_rp2040_devkit.upload.erase_cmd=
upesy_rp2040_devkit.serial.disableDTR=false
upesy_rp2040_devkit.serial.disableRTS=false
upesy_rp2040_devkit.build.f_cpu=125000000
upesy_rp2040_devkit.build.led=
upesy_rp2040_devkit.build.core=rp2040
upesy_rp2040_devkit.build.ldscript=memmap_default.ld
upesy_rp2040_devkit.build.boot2=boot2_w25q080_2_padded_checksum
upesy_rp2040_devkit.build.usb_manufacturer="uPesy"
upesy_rp2040_devkit.build.usb_product="RP2040 DevKit"
upesy_rp2040_devkit.menu.flash.2097152_0=2MB (no FS)
upesy_rp2040_devkit.menu.flash.2097152_0.upload.maximum_size=2093056
upesy_rp2040_devkit.menu.flash.2097152_0.build.flash_total=2097152
upesy_rp2040_devkit.menu.flash.2097152_0.build.flash_length=2093056
upesy_rp2040_devkit.menu.flash.2097152_0.build.eeprom_start=270528512
upesy_rp2040_devkit.menu.flash.2097152_0.build.fs_start=270528512
upesy_rp2040_devkit.menu.flash.2097152_0.build.fs_end=270528512
upesy_rp2040_devkit.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
upesy_rp2040_devkit.menu.flash.2097152_65536.upload.maximum_size=2027520
upesy_rp2040_devkit.menu.flash.2097152_65536.build.flash_total=2097152
upesy_rp2040_devkit.menu.flash.2097152_65536.build.flash_length=2027520
upesy_rp2040_devkit.menu.flash.2097152_65536.build.eeprom_start=270528512
upesy_rp2040_devkit.menu.flash.2097152_65536.build.fs_start=270462976
upesy_rp2040_devkit.menu.flash.2097152_65536.build.fs_end=270528512
upesy_rp2040_devkit.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
upesy_rp2040_devkit.menu.flash.2097152_131072.upload.maximum_size=1961984
upesy_rp2040_devkit.menu.flash.2097152_131072.build.flash_total=2097152
upesy_rp2040_devkit.menu.flash.2097152_131072.build.flash_length=1961984
upesy_rp2040_devkit.menu.flash.2097152_131072.build.eeprom_start=270528512
upesy_rp2040_devkit.menu.flash.2097152_131072.build.fs_start=270397440
upesy_rp2040_devkit.menu.flash.2097152_131072.build.fs_end=270528512
upesy_rp2040_devkit.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
upesy_rp2040_devkit.menu.flash.2097152_262144.upload.maximum_size=1830912
upesy_rp2040_devkit.menu.flash.2097152_262144.build.flash_total=2097152
upesy_rp2040_devkit.menu.flash.2097152_262144.build.flash_length=1830912
upesy_rp2040_devkit.menu.flash.2097152_262144.build.eeprom_start=270528512
upesy_rp2040_devkit.menu.flash.2097152_262144.build.fs_start=270266368
upesy_rp2040_devkit.menu.flash.2097152_262144.build.fs_end=270528512
upesy_rp2040_devkit.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
upesy_rp2040_devkit.menu.flash.2097152_524288.upload.maximum_size=1568768
upesy_rp2040_devkit.menu.flash.2097152_524288.build.flash_total=2097152
upesy_rp2040_devkit.menu.flash.2097152_524288.build.flash_length=1568768
upesy_rp2040_devkit.menu.flash.2097152_524288.build.eeprom_start=270528512
upesy_rp2040_devkit.menu.flash.2097152_524288.build.fs_start=270004224
upesy_rp2040_devkit.menu.flash.2097152_524288.build.fs_end=270528512
upesy_rp2040_devkit.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
upesy_rp2040_devkit.menu.flash.2097152_1048576.upload.maximum_size=1044480
upesy_rp2040_devkit.menu.flash.2097152_1048576.build.flash_total=2097152
upesy_rp2040_devkit.menu.flash.2097152_1048576.build.flash_length=1044480
upesy_rp2040_devkit.menu.flash.2097152_1048576.build.eeprom_start=270528512
upesy_rp2040_devkit.menu.flash.2097152_1048576.build.fs_start=269479936
upesy_rp2040_devkit.menu.flash.2097152_1048576.build.fs_end=270528512
upesy_rp2040_devkit.menu.freq.133=133 MHz
upesy_rp2040_devkit.menu.freq.133.build.f_cpu=133000000L
upesy_rp2040_devkit.menu.freq.50=50 MHz
upesy_rp2040_devkit.menu.freq.50.build.f_cpu=50000000L
upesy_rp2040_devkit.menu.freq.100=100 MHz
upesy_rp2040_devkit.menu.freq.100.build.f_cpu=100000000L
upesy_rp2040_devkit.menu.freq.120=120 MHz
upesy_rp2040_devkit.menu.freq.120.build.f_cpu=120000000L
upesy_rp2040_devkit.menu.freq.125=125 MHz
upesy_rp2040_devkit.menu.freq.125.build.f_cpu=125000000L
upesy_rp2040_devkit.menu.freq.150=150 MHz (Overclock)
upesy_rp2040_devkit.menu.freq.150.build.f_cpu=150000000L
upesy_rp2040_devkit.menu.freq.175=175 MHz (Overclock)
upesy_rp2040_devkit.menu.freq.175.build.f_cpu=175000000L
upesy_rp2040_devkit.menu.freq.200=200 MHz (Overclock)
upesy_rp2040_devkit.menu.freq.200.build.f_cpu=200000000L
upesy_rp2040_devkit.menu.freq.225=225 MHz (Overclock)
upesy_rp2040_devkit.menu.freq.225.build.f_cpu=225000000L
upesy_rp2040_devkit.menu.freq.240=240 MHz (Overclock)
upesy_rp2040_devkit.menu.freq.240.build.f_cpu=240000000L
upesy_rp2040_devkit.menu.freq.250=250 MHz (Overclock)
upesy_rp2040_devkit.menu.freq.250.build.f_cpu=250000000L
upesy_rp2040_devkit.menu.freq.275=275 MHz (Overclock)
upesy_rp2040_devkit.menu.freq.275.build.f_cpu=275000000L
upesy_rp2040_devkit.menu.freq.300=300 MHz (Overclock)
upesy_rp2040_devkit.menu.freq.300.build.f_cpu=300000000L
upesy_rp2040_devkit.menu.opt.Small=Small (-Os) (standard)
upesy_rp2040_devkit.menu.opt.Small.build.flags.optimize=-Os
upesy_rp2040_devkit.menu.opt.Optimize=Optimize (-O)
upesy_rp2040_devkit.menu.opt.Optimize.build.flags.optimize=-O
upesy_rp2040_devkit.menu.opt.Optimize2=Optimize More (-O2)
upesy_rp2040_devkit.menu.opt.Optimize2.build.flags.optimize=-O2
upesy_rp2040_devkit.menu.opt.Optimize3=Optimize Even More (-O3)
upesy_rp2040_devkit.menu.opt.Optimize3.build.flags.optimize=-O3
upesy_rp2040_devkit.menu.opt.Fast=Fast (-Ofast) (maybe slower)
upesy_rp2040_devkit.menu.opt.Fast.build.flags.optimize=-Ofast
upesy_rp2040_devkit.menu.opt.Debug=Debug (-Og)
upesy_rp2040_devkit.menu.opt.Debug.build.flags.optimize=-Og
upesy_rp2040_devkit.menu.rtti.Disabled=Disabled
upesy_rp2040_devkit.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
upesy_rp2040_devkit.menu.rtti.Enabled=Enabled
upesy_rp2040_devkit.menu.rtti.Enabled.build.flags.rtti=
upesy_rp2040_devkit.menu.stackprotect.Disabled=Disabled
upesy_rp2040_devkit.menu.stackprotect.Disabled.build.flags.stackprotect=
upesy_rp2040_devkit.menu.stackprotect.Enabled=Enabled
upesy_rp2040_devkit.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
upesy_rp2040_devkit.menu.exceptions.Disabled=Disabled
upesy_rp2040_devkit.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
upesy_rp2040_devkit.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
upesy_rp2040_devkit.menu.exceptions.Enabled=Enabled
upesy_rp2040_devkit.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
upesy_rp2040_devkit.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
upesy_rp2040_devkit.menu.dbgport.Disabled=Disabled
upesy_rp2040_devkit.menu.dbgport.Disabled.build.debug_port=
upesy_rp2040_devkit.menu.dbgport.Serial=Serial
upesy_rp2040_devkit.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
upesy_rp2040_devkit.menu.dbgport.Serial1=Serial1
upesy_rp2040_devkit.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
upesy_rp2040_devkit.menu.dbgport.Serial2=Serial2
upesy_rp2040_devkit.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
upesy_rp2040_devkit.menu.dbglvl.None=None
upesy_rp2040_devkit.menu.dbglvl.None.build.debug_level=
upesy_rp2040_devkit.menu.dbglvl.Core=Core
upesy_rp2040_devkit.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
upesy_rp2040_devkit.menu.dbglvl.SPI=SPI
upesy_rp2040_devkit.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
upesy_rp2040_devkit.menu.dbglvl.Wire=Wire
upesy_rp2040_devkit.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
upesy_rp2040_devkit.menu.dbglvl.Bluetooth=Bluetooth
upesy_rp2040_devkit.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
upesy_rp2040_devkit.menu.dbglvl.All=All
upesy_rp2040_devkit.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
upesy_rp2040_devkit.menu.dbglvl.NDEBUG=NDEBUG
upesy_rp2040_devkit.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
upesy_rp2040_devkit.menu.usbstack.picosdk=Pico SDK
upesy_rp2040_devkit.menu.usbstack.picosdk.build.usbstack_flags=
upesy_rp2040_devkit.menu.usbstack.tinyusb=Adafruit TinyUSB
upesy_rp2040_devkit.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
upesy_rp2040_devkit.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host
upesy_rp2040_devkit.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
upesy_rp2040_devkit.menu.usbstack.nousb=No USB
upesy_rp2040_devkit.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
upesy_rp2040_devkit.menu.ipbtstack.ipv4only=IPv4 Only
upesy_rp2040_devkit.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
upesy_rp2040_devkit.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
upesy_rp2040_devkit.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
upesy_rp2040_devkit.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
upesy_rp2040_devkit.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
upesy_rp2040_devkit.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
upesy_rp2040_devkit.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
upesy_rp2040_devkit.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
upesy_rp2040_devkit.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
upesy_rp2040_devkit.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
upesy_rp2040_devkit.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
upesy_rp2040_devkit.menu.uploadmethod.default=Default (UF2)
upesy_rp2040_devkit.menu.uploadmethod.default.build.ram_length=256k
upesy_rp2040_devkit.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
upesy_rp2040_devkit.menu.uploadmethod.default.upload.maximum_data_size=262144
upesy_rp2040_devkit.menu.uploadmethod.default.upload.tool=uf2conv
upesy_rp2040_devkit.menu.uploadmethod.default.upload.tool.default=uf2conv
upesy_rp2040_devkit.menu.uploadmethod.default.upload.tool.network=uf2conv-network
upesy_rp2040_devkit.menu.uploadmethod.picotool=Picotool
upesy_rp2040_devkit.menu.uploadmethod.picotool.build.ram_length=256k
upesy_rp2040_devkit.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
upesy_rp2040_devkit.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
upesy_rp2040_devkit.menu.uploadmethod.picotool.upload.maximum_data_size=262144
upesy_rp2040_devkit.menu.uploadmethod.picotool.upload.tool=picotool
upesy_rp2040_devkit.menu.uploadmethod.picotool.upload.tool.default=picotool
upesy_rp2040_devkit.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
upesy_rp2040_devkit.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
upesy_rp2040_devkit.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
upesy_rp2040_devkit.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
upesy_rp2040_devkit.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
upesy_rp2040_devkit.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
upesy_rp2040_devkit.menu.uploadmethod.picodebug=Pico-Debug
upesy_rp2040_devkit.menu.uploadmethod.picodebug.build.ram_length=240k
upesy_rp2040_devkit.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
upesy_rp2040_devkit.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
upesy_rp2040_devkit.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
upesy_rp2040_devkit.menu.uploadmethod.picodebug.upload.tool=picodebug
upesy_rp2040_devkit.menu.uploadmethod.picodebug.upload.tool.default=picodebug

