earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# VCC-GND YD RP2040
# -----------------------------------
vccgnd_yd_rp2040.name=VCC-GND YD RP2040
vccgnd_yd_rp2040.vid.0=0x2e8a
vccgnd_yd_rp2040.pid.0=0x800a
vccgnd_yd_rp2040.vid.1=0x2e8a
vccgnd_yd_rp2040.pid.1=0x810a
vccgnd_yd_rp2040.vid.2=0x2e8a
vccgnd_yd_rp2040.pid.2=0xc00a
vccgnd_yd_rp2040.vid.3=0x2e8a
vccgnd_yd_rp2040.pid.3=0xc10a
vccgnd_yd_rp2040.vid.4=0x2e8a
vccgnd_yd_rp2040.pid.4=0x800a
vccgnd_yd_rp2040.vid.5=0x2e8a
vccgnd_yd_rp2040.pid.5=0x810a
vccgnd_yd_rp2040.vid.6=0x2e8a
vccgnd_yd_rp2040.pid.6=0xc00a
vccgnd_yd_rp2040.vid.7=0x2e8a
vccgnd_yd_rp2040.pid.7=0xc10a
vccgnd_yd_rp2040.build.usbvid=-DUSBD_VID=0x2e8a
vccgnd_yd_rp2040.build.usbpid=-DUSBD_PID=0x800a
vccgnd_yd_rp2040.build.usbpwr=-DUSBD_MAX_POWER_MA=500
vccgnd_yd_rp2040.build.board=YD_RP2040
vccgnd_yd_rp2040.build.mcu=cortex-m0plus
vccgnd_yd_rp2040.build.variant=vccgnd_yd_rp2040
vccgnd_yd_rp2040.upload.maximum_size=16777216
vccgnd_yd_rp2040.upload.wait_for_upload_port=true
vccgnd_yd_rp2040.upload.erase_cmd=
vccgnd_yd_rp2040.serial.disableDTR=false
vccgnd_yd_rp2040.serial.disableRTS=false
vccgnd_yd_rp2040.build.f_cpu=125000000
vccgnd_yd_rp2040.build.led=
vccgnd_yd_rp2040.build.core=rp2040
vccgnd_yd_rp2040.build.ldscript=memmap_default.ld
vccgnd_yd_rp2040.build.boot2=boot2_generic_03h_4_padded_checksum
vccgnd_yd_rp2040.build.usb_manufacturer="VCC-GND"
vccgnd_yd_rp2040.build.usb_product="YD RP2040"
vccgnd_yd_rp2040.menu.flash.2097152_0=2MB (no FS)
vccgnd_yd_rp2040.menu.flash.2097152_0.upload.maximum_size=2093056
vccgnd_yd_rp2040.menu.flash.2097152_0.build.flash_total=2097152
vccgnd_yd_rp2040.menu.flash.2097152_0.build.flash_length=2093056
vccgnd_yd_rp2040.menu.flash.2097152_0.build.eeprom_start=270528512
vccgnd_yd_rp2040.menu.flash.2097152_0.build.fs_start=270528512
vccgnd_yd_rp2040.menu.flash.2097152_0.build.fs_end=270528512
vccgnd_yd_rp2040.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
vccgnd_yd_rp2040.menu.flash.2097152_1048576.upload.maximum_size=1044480
vccgnd_yd_rp2040.menu.flash.2097152_1048576.build.flash_total=2097152
vccgnd_yd_rp2040.menu.flash.2097152_1048576.build.flash_length=1044480
vccgnd_yd_rp2040.menu.flash.2097152_1048576.build.eeprom_start=270528512
vccgnd_yd_rp2040.menu.flash.2097152_1048576.build.fs_start=269479936
vccgnd_yd_rp2040.menu.flash.2097152_1048576.build.fs_end=270528512
vccgnd_yd_rp2040.menu.flash.4194304_0=4MB (no FS)
vccgnd_yd_rp2040.menu.flash.4194304_0.upload.maximum_size=4190208
vccgnd_yd_rp2040.menu.flash.4194304_0.build.flash_total=4194304
vccgnd_yd_rp2040.menu.flash.4194304_0.build.flash_length=4190208
vccgnd_yd_rp2040.menu.flash.4194304_0.build.eeprom_start=272625664
vccgnd_yd_rp2040.menu.flash.4194304_0.build.fs_start=272625664
vccgnd_yd_rp2040.menu.flash.4194304_0.build.fs_end=272625664
vccgnd_yd_rp2040.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
vccgnd_yd_rp2040.menu.flash.4194304_3145728.upload.maximum_size=1044480
vccgnd_yd_rp2040.menu.flash.4194304_3145728.build.flash_total=4194304
vccgnd_yd_rp2040.menu.flash.4194304_3145728.build.flash_length=1044480
vccgnd_yd_rp2040.menu.flash.4194304_3145728.build.eeprom_start=272625664
vccgnd_yd_rp2040.menu.flash.4194304_3145728.build.fs_start=269479936
vccgnd_yd_rp2040.menu.flash.4194304_3145728.build.fs_end=272625664
vccgnd_yd_rp2040.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
vccgnd_yd_rp2040.menu.flash.4194304_2097152.upload.maximum_size=2093056
vccgnd_yd_rp2040.menu.flash.4194304_2097152.build.flash_total=4194304
vccgnd_yd_rp2040.menu.flash.4194304_2097152.build.flash_length=2093056
vccgnd_yd_rp2040.menu.flash.4194304_2097152.build.eeprom_start=272625664
vccgnd_yd_rp2040.menu.flash.4194304_2097152.build.fs_start=270528512
vccgnd_yd_rp2040.menu.flash.4194304_2097152.build.fs_end=272625664
vccgnd_yd_rp2040.menu.flash.8388608_0=8MB (no FS)
vccgnd_yd_rp2040.menu.flash.8388608_0.upload.maximum_size=8384512
vccgnd_yd_rp2040.menu.flash.8388608_0.build.flash_total=8388608
vccgnd_yd_rp2040.menu.flash.8388608_0.build.flash_length=8384512
vccgnd_yd_rp2040.menu.flash.8388608_0.build.eeprom_start=276819968
vccgnd_yd_rp2040.menu.flash.8388608_0.build.fs_start=276819968
vccgnd_yd_rp2040.menu.flash.8388608_0.build.fs_end=276819968
vccgnd_yd_rp2040.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
vccgnd_yd_rp2040.menu.flash.8388608_7340032.upload.maximum_size=1044480
vccgnd_yd_rp2040.menu.flash.8388608_7340032.build.flash_total=8388608
vccgnd_yd_rp2040.menu.flash.8388608_7340032.build.flash_length=1044480
vccgnd_yd_rp2040.menu.flash.8388608_7340032.build.eeprom_start=276819968
vccgnd_yd_rp2040.menu.flash.8388608_7340032.build.fs_start=269479936
vccgnd_yd_rp2040.menu.flash.8388608_7340032.build.fs_end=276819968
vccgnd_yd_rp2040.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
vccgnd_yd_rp2040.menu.flash.8388608_4194304.upload.maximum_size=4190208
vccgnd_yd_rp2040.menu.flash.8388608_4194304.build.flash_total=8388608
vccgnd_yd_rp2040.menu.flash.8388608_4194304.build.flash_length=4190208
vccgnd_yd_rp2040.menu.flash.8388608_4194304.build.eeprom_start=276819968
vccgnd_yd_rp2040.menu.flash.8388608_4194304.build.fs_start=272625664
vccgnd_yd_rp2040.menu.flash.8388608_4194304.build.fs_end=276819968
vccgnd_yd_rp2040.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
vccgnd_yd_rp2040.menu.flash.8388608_2097152.upload.maximum_size=6287360
vccgnd_yd_rp2040.menu.flash.8388608_2097152.build.flash_total=8388608
vccgnd_yd_rp2040.menu.flash.8388608_2097152.build.flash_length=6287360
vccgnd_yd_rp2040.menu.flash.8388608_2097152.build.eeprom_start=276819968
vccgnd_yd_rp2040.menu.flash.8388608_2097152.build.fs_start=274722816
vccgnd_yd_rp2040.menu.flash.8388608_2097152.build.fs_end=276819968
vccgnd_yd_rp2040.menu.flash.16777216_0=16MB (no FS)
vccgnd_yd_rp2040.menu.flash.16777216_0.upload.maximum_size=16773120
vccgnd_yd_rp2040.menu.flash.16777216_0.build.flash_total=16777216
vccgnd_yd_rp2040.menu.flash.16777216_0.build.flash_length=16773120
vccgnd_yd_rp2040.menu.flash.16777216_0.build.eeprom_start=285208576
vccgnd_yd_rp2040.menu.flash.16777216_0.build.fs_start=285208576
vccgnd_yd_rp2040.menu.flash.16777216_0.build.fs_end=285208576
vccgnd_yd_rp2040.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
vccgnd_yd_rp2040.menu.flash.16777216_15728640.upload.maximum_size=1044480
vccgnd_yd_rp2040.menu.flash.16777216_15728640.build.flash_total=16777216
vccgnd_yd_rp2040.menu.flash.16777216_15728640.build.flash_length=1044480
vccgnd_yd_rp2040.menu.flash.16777216_15728640.build.eeprom_start=285208576
vccgnd_yd_rp2040.menu.flash.16777216_15728640.build.fs_start=269479936
vccgnd_yd_rp2040.menu.flash.16777216_15728640.build.fs_end=285208576
vccgnd_yd_rp2040.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
vccgnd_yd_rp2040.menu.flash.16777216_14680064.upload.maximum_size=2093056
vccgnd_yd_rp2040.menu.flash.16777216_14680064.build.flash_total=16777216
vccgnd_yd_rp2040.menu.flash.16777216_14680064.build.flash_length=2093056
vccgnd_yd_rp2040.menu.flash.16777216_14680064.build.eeprom_start=285208576
vccgnd_yd_rp2040.menu.flash.16777216_14680064.build.fs_start=270528512
vccgnd_yd_rp2040.menu.flash.16777216_14680064.build.fs_end=285208576
vccgnd_yd_rp2040.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
vccgnd_yd_rp2040.menu.flash.16777216_12582912.upload.maximum_size=4190208
vccgnd_yd_rp2040.menu.flash.16777216_12582912.build.flash_total=16777216
vccgnd_yd_rp2040.menu.flash.16777216_12582912.build.flash_length=4190208
vccgnd_yd_rp2040.menu.flash.16777216_12582912.build.eeprom_start=285208576
vccgnd_yd_rp2040.menu.flash.16777216_12582912.build.fs_start=272625664
vccgnd_yd_rp2040.menu.flash.16777216_12582912.build.fs_end=285208576
vccgnd_yd_rp2040.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
vccgnd_yd_rp2040.menu.flash.16777216_8388608.upload.maximum_size=8384512
vccgnd_yd_rp2040.menu.flash.16777216_8388608.build.flash_total=16777216
vccgnd_yd_rp2040.menu.flash.16777216_8388608.build.flash_length=8384512
vccgnd_yd_rp2040.menu.flash.16777216_8388608.build.eeprom_start=285208576
vccgnd_yd_rp2040.menu.flash.16777216_8388608.build.fs_start=276819968
vccgnd_yd_rp2040.menu.flash.16777216_8388608.build.fs_end=285208576
vccgnd_yd_rp2040.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
vccgnd_yd_rp2040.menu.flash.16777216_4194304.upload.maximum_size=12578816
vccgnd_yd_rp2040.menu.flash.16777216_4194304.build.flash_total=16777216
vccgnd_yd_rp2040.menu.flash.16777216_4194304.build.flash_length=12578816
vccgnd_yd_rp2040.menu.flash.16777216_4194304.build.eeprom_start=285208576
vccgnd_yd_rp2040.menu.flash.16777216_4194304.build.fs_start=281014272
vccgnd_yd_rp2040.menu.flash.16777216_4194304.build.fs_end=285208576
vccgnd_yd_rp2040.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
vccgnd_yd_rp2040.menu.flash.16777216_2097152.upload.maximum_size=14675968
vccgnd_yd_rp2040.menu.flash.16777216_2097152.build.flash_total=16777216
vccgnd_yd_rp2040.menu.flash.16777216_2097152.build.flash_length=14675968
vccgnd_yd_rp2040.menu.flash.16777216_2097152.build.eeprom_start=285208576
vccgnd_yd_rp2040.menu.flash.16777216_2097152.build.fs_start=283111424
vccgnd_yd_rp2040.menu.flash.16777216_2097152.build.fs_end=285208576
vccgnd_yd_rp2040.menu.freq.133=133 MHz
vccgnd_yd_rp2040.menu.freq.133.build.f_cpu=133000000L
vccgnd_yd_rp2040.menu.freq.50=50 MHz
vccgnd_yd_rp2040.menu.freq.50.build.f_cpu=50000000L
vccgnd_yd_rp2040.menu.freq.100=100 MHz
vccgnd_yd_rp2040.menu.freq.100.build.f_cpu=100000000L
vccgnd_yd_rp2040.menu.freq.120=120 MHz
vccgnd_yd_rp2040.menu.freq.120.build.f_cpu=120000000L
vccgnd_yd_rp2040.menu.freq.125=125 MHz
vccgnd_yd_rp2040.menu.freq.125.build.f_cpu=125000000L
vccgnd_yd_rp2040.menu.freq.150=150 MHz (Overclock)
vccgnd_yd_rp2040.menu.freq.150.build.f_cpu=150000000L
vccgnd_yd_rp2040.menu.freq.175=175 MHz (Overclock)
vccgnd_yd_rp2040.menu.freq.175.build.f_cpu=175000000L
vccgnd_yd_rp2040.menu.freq.200=200 MHz (Overclock)
vccgnd_yd_rp2040.menu.freq.200.build.f_cpu=200000000L
vccgnd_yd_rp2040.menu.freq.225=225 MHz (Overclock)
vccgnd_yd_rp2040.menu.freq.225.build.f_cpu=225000000L
vccgnd_yd_rp2040.menu.freq.240=240 MHz (Overclock)
vccgnd_yd_rp2040.menu.freq.240.build.f_cpu=240000000L
vccgnd_yd_rp2040.menu.freq.250=250 MHz (Overclock)
vccgnd_yd_rp2040.menu.freq.250.build.f_cpu=250000000L
vccgnd_yd_rp2040.menu.freq.275=275 MHz (Overclock)
vccgnd_yd_rp2040.menu.freq.275.build.f_cpu=275000000L
vccgnd_yd_rp2040.menu.freq.300=300 MHz (Overclock)
vccgnd_yd_rp2040.menu.freq.300.build.f_cpu=300000000L
vccgnd_yd_rp2040.menu.opt.Small=Small (-Os) (standard)
vccgnd_yd_rp2040.menu.opt.Small.build.flags.optimize=-Os
vccgnd_yd_rp2040.menu.opt.Optimize=Optimize (-O)
vccgnd_yd_rp2040.menu.opt.Optimize.build.flags.optimize=-O
vccgnd_yd_rp2040.menu.opt.Optimize2=Optimize More (-O2)
vccgnd_yd_rp2040.menu.opt.Optimize2.build.flags.optimize=-O2
vccgnd_yd_rp2040.menu.opt.Optimize3=Optimize Even More (-O3)
vccgnd_yd_rp2040.menu.opt.Optimize3.build.flags.optimize=-O3
vccgnd_yd_rp2040.menu.opt.Fast=Fast (-Ofast) (maybe slower)
vccgnd_yd_rp2040.menu.opt.Fast.build.flags.optimize=-Ofast
vccgnd_yd_rp2040.menu.opt.Debug=Debug (-Og)
vccgnd_yd_rp2040.menu.opt.Debug.build.flags.optimize=-Og
vccgnd_yd_rp2040.menu.rtti.Disabled=Disabled
vccgnd_yd_rp2040.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
vccgnd_yd_rp2040.menu.rtti.Enabled=Enabled
vccgnd_yd_rp2040.menu.rtti.Enabled.build.flags.rtti=
vccgnd_yd_rp2040.menu.stackprotect.Disabled=Disabled
vccgnd_yd_rp2040.menu.stackprotect.Disabled.build.flags.stackprotect=
vccgnd_yd_rp2040.menu.stackprotect.Enabled=Enabled
vccgnd_yd_rp2040.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
vccgnd_yd_rp2040.menu.exceptions.Disabled=Disabled
vccgnd_yd_rp2040.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
vccgnd_yd_rp2040.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
vccgnd_yd_rp2040.menu.exceptions.Enabled=Enabled
vccgnd_yd_rp2040.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
vccgnd_yd_rp2040.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
vccgnd_yd_rp2040.menu.dbgport.Disabled=Disabled
vccgnd_yd_rp2040.menu.dbgport.Disabled.build.debug_port=
vccgnd_yd_rp2040.menu.dbgport.Serial=Serial
vccgnd_yd_rp2040.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
vccgnd_yd_rp2040.menu.dbgport.Serial1=Serial1
vccgnd_yd_rp2040.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
vccgnd_yd_rp2040.menu.dbgport.Serial2=Serial2
vccgnd_yd_rp2040.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
vccgnd_yd_rp2040.menu.dbglvl.None=None
vccgnd_yd_rp2040.menu.dbglvl.None.build.debug_level=
vccgnd_yd_rp2040.menu.dbglvl.Core=Core
vccgnd_yd_rp2040.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
vccgnd_yd_rp2040.menu.dbglvl.SPI=SPI
vccgnd_yd_rp2040.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
vccgnd_yd_rp2040.menu.dbglvl.Wire=Wire
vccgnd_yd_rp2040.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
vccgnd_yd_rp2040.menu.dbglvl.Bluetooth=Bluetooth
vccgnd_yd_rp2040.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
vccgnd_yd_rp2040.menu.dbglvl.All=All
vccgnd_yd_rp2040.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
vccgnd_yd_rp2040.menu.dbglvl.NDEBUG=NDEBUG
vccgnd_yd_rp2040.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
vccgnd_yd_rp2040.menu.usbstack.picosdk=Pico SDK
vccgnd_yd_rp2040.menu.usbstack.picosdk.build.usbstack_flags=
vccgnd_yd_rp2040.menu.usbstack.tinyusb=Adafruit TinyUSB
vccgnd_yd_rp2040.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
vccgnd_yd_rp2040.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host
vccgnd_yd_rp2040.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
vccgnd_yd_rp2040.menu.usbstack.nousb=No USB
vccgnd_yd_rp2040.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
vccgnd_yd_rp2040.menu.ipbtstack.ipv4only=IPv4 Only
vccgnd_yd_rp2040.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
vccgnd_yd_rp2040.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
vccgnd_yd_rp2040.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
vccgnd_yd_rp2040.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
vccgnd_yd_rp2040.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
vccgnd_yd_rp2040.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
vccgnd_yd_rp2040.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
vccgnd_yd_rp2040.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
vccgnd_yd_rp2040.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
vccgnd_yd_rp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
vccgnd_yd_rp2040.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
vccgnd_yd_rp2040.menu.uploadmethod.default=Default (UF2)
vccgnd_yd_rp2040.menu.uploadmethod.default.build.ram_length=256k
vccgnd_yd_rp2040.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
vccgnd_yd_rp2040.menu.uploadmethod.default.upload.maximum_data_size=262144
vccgnd_yd_rp2040.menu.uploadmethod.default.upload.tool=uf2conv
vccgnd_yd_rp2040.menu.uploadmethod.default.upload.tool.default=uf2conv
vccgnd_yd_rp2040.menu.uploadmethod.default.upload.tool.network=uf2conv-network
vccgnd_yd_rp2040.menu.uploadmethod.picotool=Picotool
vccgnd_yd_rp2040.menu.uploadmethod.picotool.build.ram_length=256k
vccgnd_yd_rp2040.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
vccgnd_yd_rp2040.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
vccgnd_yd_rp2040.menu.uploadmethod.picotool.upload.maximum_data_size=262144
vccgnd_yd_rp2040.menu.uploadmethod.picotool.upload.tool=picotool
vccgnd_yd_rp2040.menu.uploadmethod.picotool.upload.tool.default=picotool
vccgnd_yd_rp2040.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
vccgnd_yd_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
vccgnd_yd_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
vccgnd_yd_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
vccgnd_yd_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
vccgnd_yd_rp2040.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
vccgnd_yd_rp2040.menu.uploadmethod.picodebug=Pico-Debug
vccgnd_yd_rp2040.menu.uploadmethod.picodebug.build.ram_length=240k
vccgnd_yd_rp2040.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
vccgnd_yd_rp2040.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
vccgnd_yd_rp2040.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
vccgnd_yd_rp2040.menu.uploadmethod.picodebug.upload.tool=picodebug
vccgnd_yd_rp2040.menu.uploadmethod.picodebug.upload.tool.default=picodebug

