earlephilhower/arduino-pico/boards.txt
# -----------------------------------
# WIZnet WizFi360-EVB-Pico
# -----------------------------------
wiznet_wizfi360_evb_pico.name=WIZnet WizFi360-EVB-Pico
wiznet_wizfi360_evb_pico.vid.0=0x2e8a
wiznet_wizfi360_evb_pico.pid.0=0x1028
wiznet_wizfi360_evb_pico.vid.1=0x2e8a
wiznet_wizfi360_evb_pico.pid.1=0x1128
wiznet_wizfi360_evb_pico.vid.2=0x2e8a
wiznet_wizfi360_evb_pico.pid.2=0x5028
wiznet_wizfi360_evb_pico.vid.3=0x2e8a
wiznet_wizfi360_evb_pico.pid.3=0x5128
wiznet_wizfi360_evb_pico.vid.4=0x2e8a
wiznet_wizfi360_evb_pico.pid.4=0x9028
wiznet_wizfi360_evb_pico.vid.5=0x2e8a
wiznet_wizfi360_evb_pico.pid.5=0x9128
wiznet_wizfi360_evb_pico.vid.6=0x2e8a
wiznet_wizfi360_evb_pico.pid.6=0xd028
wiznet_wizfi360_evb_pico.vid.7=0x2e8a
wiznet_wizfi360_evb_pico.pid.7=0xd128
wiznet_wizfi360_evb_pico.build.usbvid=-DUSBD_VID=0x2e8a
wiznet_wizfi360_evb_pico.build.usbpid=-DUSBD_PID=0x1028
wiznet_wizfi360_evb_pico.build.usbpwr=-DUSBD_MAX_POWER_MA=250
wiznet_wizfi360_evb_pico.build.board=WIZNET_WIZFI360_EVB_PICO
wiznet_wizfi360_evb_pico.build.mcu=cortex-m0plus
wiznet_wizfi360_evb_pico.build.variant=wiznet_wizfi360_evb_pico
wiznet_wizfi360_evb_pico.upload.maximum_size=2097152
wiznet_wizfi360_evb_pico.upload.wait_for_upload_port=true
wiznet_wizfi360_evb_pico.upload.erase_cmd=
wiznet_wizfi360_evb_pico.serial.disableDTR=false
wiznet_wizfi360_evb_pico.serial.disableRTS=false
wiznet_wizfi360_evb_pico.build.f_cpu=125000000
wiznet_wizfi360_evb_pico.build.led=
wiznet_wizfi360_evb_pico.build.core=rp2040
wiznet_wizfi360_evb_pico.build.ldscript=memmap_default.ld
wiznet_wizfi360_evb_pico.build.boot2=boot2_w25q080_2_padded_checksum
wiznet_wizfi360_evb_pico.build.usb_manufacturer="WIZnet"
wiznet_wizfi360_evb_pico.build.usb_product="WizFi360-EVB-Pico"
wiznet_wizfi360_evb_pico.menu.flash.2097152_0=2MB (no FS)
wiznet_wizfi360_evb_pico.menu.flash.2097152_0.upload.maximum_size=2093056
wiznet_wizfi360_evb_pico.menu.flash.2097152_0.build.flash_total=2097152
wiznet_wizfi360_evb_pico.menu.flash.2097152_0.build.flash_length=2093056
wiznet_wizfi360_evb_pico.menu.flash.2097152_0.build.eeprom_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_0.build.fs_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_0.build.fs_end=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
wiznet_wizfi360_evb_pico.menu.flash.2097152_65536.upload.maximum_size=2027520
wiznet_wizfi360_evb_pico.menu.flash.2097152_65536.build.flash_total=2097152
wiznet_wizfi360_evb_pico.menu.flash.2097152_65536.build.flash_length=2027520
wiznet_wizfi360_evb_pico.menu.flash.2097152_65536.build.eeprom_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_65536.build.fs_start=270462976
wiznet_wizfi360_evb_pico.menu.flash.2097152_65536.build.fs_end=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
wiznet_wizfi360_evb_pico.menu.flash.2097152_131072.upload.maximum_size=1961984
wiznet_wizfi360_evb_pico.menu.flash.2097152_131072.build.flash_total=2097152
wiznet_wizfi360_evb_pico.menu.flash.2097152_131072.build.flash_length=1961984
wiznet_wizfi360_evb_pico.menu.flash.2097152_131072.build.eeprom_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_131072.build.fs_start=270397440
wiznet_wizfi360_evb_pico.menu.flash.2097152_131072.build.fs_end=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
wiznet_wizfi360_evb_pico.menu.flash.2097152_262144.upload.maximum_size=1830912
wiznet_wizfi360_evb_pico.menu.flash.2097152_262144.build.flash_total=2097152
wiznet_wizfi360_evb_pico.menu.flash.2097152_262144.build.flash_length=1830912
wiznet_wizfi360_evb_pico.menu.flash.2097152_262144.build.eeprom_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_262144.build.fs_start=270266368
wiznet_wizfi360_evb_pico.menu.flash.2097152_262144.build.fs_end=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
wiznet_wizfi360_evb_pico.menu.flash.2097152_524288.upload.maximum_size=1568768
wiznet_wizfi360_evb_pico.menu.flash.2097152_524288.build.flash_total=2097152
wiznet_wizfi360_evb_pico.menu.flash.2097152_524288.build.flash_length=1568768
wiznet_wizfi360_evb_pico.menu.flash.2097152_524288.build.eeprom_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_524288.build.fs_start=270004224
wiznet_wizfi360_evb_pico.menu.flash.2097152_524288.build.fs_end=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
wiznet_wizfi360_evb_pico.menu.flash.2097152_1048576.upload.maximum_size=1044480
wiznet_wizfi360_evb_pico.menu.flash.2097152_1048576.build.flash_total=2097152
wiznet_wizfi360_evb_pico.menu.flash.2097152_1048576.build.flash_length=1044480
wiznet_wizfi360_evb_pico.menu.flash.2097152_1048576.build.eeprom_start=270528512
wiznet_wizfi360_evb_pico.menu.flash.2097152_1048576.build.fs_start=269479936
wiznet_wizfi360_evb_pico.menu.flash.2097152_1048576.build.fs_end=270528512
wiznet_wizfi360_evb_pico.menu.freq.133=133 MHz
wiznet_wizfi360_evb_pico.menu.freq.133.build.f_cpu=133000000L
wiznet_wizfi360_evb_pico.menu.freq.50=50 MHz
wiznet_wizfi360_evb_pico.menu.freq.50.build.f_cpu=50000000L
wiznet_wizfi360_evb_pico.menu.freq.100=100 MHz
wiznet_wizfi360_evb_pico.menu.freq.100.build.f_cpu=100000000L
wiznet_wizfi360_evb_pico.menu.freq.120=120 MHz
wiznet_wizfi360_evb_pico.menu.freq.120.build.f_cpu=120000000L
wiznet_wizfi360_evb_pico.menu.freq.125=125 MHz
wiznet_wizfi360_evb_pico.menu.freq.125.build.f_cpu=125000000L
wiznet_wizfi360_evb_pico.menu.freq.150=150 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.150.build.f_cpu=150000000L
wiznet_wizfi360_evb_pico.menu.freq.175=175 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.175.build.f_cpu=175000000L
wiznet_wizfi360_evb_pico.menu.freq.200=200 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.200.build.f_cpu=200000000L
wiznet_wizfi360_evb_pico.menu.freq.225=225 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.225.build.f_cpu=225000000L
wiznet_wizfi360_evb_pico.menu.freq.240=240 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.240.build.f_cpu=240000000L
wiznet_wizfi360_evb_pico.menu.freq.250=250 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.250.build.f_cpu=250000000L
wiznet_wizfi360_evb_pico.menu.freq.275=275 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.275.build.f_cpu=275000000L
wiznet_wizfi360_evb_pico.menu.freq.300=300 MHz (Overclock)
wiznet_wizfi360_evb_pico.menu.freq.300.build.f_cpu=300000000L
wiznet_wizfi360_evb_pico.menu.opt.Small=Small (-Os) (standard)
wiznet_wizfi360_evb_pico.menu.opt.Small.build.flags.optimize=-Os
wiznet_wizfi360_evb_pico.menu.opt.Optimize=Optimize (-O)
wiznet_wizfi360_evb_pico.menu.opt.Optimize.build.flags.optimize=-O
wiznet_wizfi360_evb_pico.menu.opt.Optimize2=Optimize More (-O2)
wiznet_wizfi360_evb_pico.menu.opt.Optimize2.build.flags.optimize=-O2
wiznet_wizfi360_evb_pico.menu.opt.Optimize3=Optimize Even More (-O3)
wiznet_wizfi360_evb_pico.menu.opt.Optimize3.build.flags.optimize=-O3
wiznet_wizfi360_evb_pico.menu.opt.Fast=Fast (-Ofast) (maybe slower)
wiznet_wizfi360_evb_pico.menu.opt.Fast.build.flags.optimize=-Ofast
wiznet_wizfi360_evb_pico.menu.opt.Debug=Debug (-Og)
wiznet_wizfi360_evb_pico.menu.opt.Debug.build.flags.optimize=-Og
wiznet_wizfi360_evb_pico.menu.rtti.Disabled=Disabled
wiznet_wizfi360_evb_pico.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
wiznet_wizfi360_evb_pico.menu.rtti.Enabled=Enabled
wiznet_wizfi360_evb_pico.menu.rtti.Enabled.build.flags.rtti=
wiznet_wizfi360_evb_pico.menu.stackprotect.Disabled=Disabled
wiznet_wizfi360_evb_pico.menu.stackprotect.Disabled.build.flags.stackprotect=
wiznet_wizfi360_evb_pico.menu.stackprotect.Enabled=Enabled
wiznet_wizfi360_evb_pico.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
wiznet_wizfi360_evb_pico.menu.exceptions.Disabled=Disabled
wiznet_wizfi360_evb_pico.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
wiznet_wizfi360_evb_pico.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
wiznet_wizfi360_evb_pico.menu.exceptions.Enabled=Enabled
wiznet_wizfi360_evb_pico.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
wiznet_wizfi360_evb_pico.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
wiznet_wizfi360_evb_pico.menu.dbgport.Disabled=Disabled
wiznet_wizfi360_evb_pico.menu.dbgport.Disabled.build.debug_port=
wiznet_wizfi360_evb_pico.menu.dbgport.Serial=Serial
wiznet_wizfi360_evb_pico.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
wiznet_wizfi360_evb_pico.menu.dbgport.Serial1=Serial1
wiznet_wizfi360_evb_pico.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
wiznet_wizfi360_evb_pico.menu.dbgport.Serial2=Serial2
wiznet_wizfi360_evb_pico.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
wiznet_wizfi360_evb_pico.menu.dbglvl.None=None
wiznet_wizfi360_evb_pico.menu.dbglvl.None.build.debug_level=
wiznet_wizfi360_evb_pico.menu.dbglvl.Core=Core
wiznet_wizfi360_evb_pico.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
wiznet_wizfi360_evb_pico.menu.dbglvl.SPI=SPI
wiznet_wizfi360_evb_pico.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
wiznet_wizfi360_evb_pico.menu.dbglvl.Wire=Wire
wiznet_wizfi360_evb_pico.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
wiznet_wizfi360_evb_pico.menu.dbglvl.Bluetooth=Bluetooth
wiznet_wizfi360_evb_pico.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
wiznet_wizfi360_evb_pico.menu.dbglvl.All=All
wiznet_wizfi360_evb_pico.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH
wiznet_wizfi360_evb_pico.menu.dbglvl.NDEBUG=NDEBUG
wiznet_wizfi360_evb_pico.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
wiznet_wizfi360_evb_pico.menu.usbstack.picosdk=Pico SDK
wiznet_wizfi360_evb_pico.menu.usbstack.picosdk.build.usbstack_flags=
wiznet_wizfi360_evb_pico.menu.usbstack.tinyusb=Adafruit TinyUSB
wiznet_wizfi360_evb_pico.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
wiznet_wizfi360_evb_pico.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host
wiznet_wizfi360_evb_pico.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
wiznet_wizfi360_evb_pico.menu.usbstack.nousb=No USB
wiznet_wizfi360_evb_pico.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
wiznet_wizfi360_evb_pico.menu.ipbtstack.ipv4only=IPv4 Only
wiznet_wizfi360_evb_pico.menu.ipbtstack.ipv4only.build.libpicow=libpicow-noipv6-nobtc-noble.a
wiznet_wizfi360_evb_pico.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
wiznet_wizfi360_evb_pico.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
wiznet_wizfi360_evb_pico.menu.ipbtstack.ipv4ipv6.build.libpicow=libpicow-ipv6-nobtc-noble.a
wiznet_wizfi360_evb_pico.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
wiznet_wizfi360_evb_pico.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
wiznet_wizfi360_evb_pico.menu.ipbtstack.ipv4btcble.build.libpicow=libpicow-noipv6-btc-ble.a
wiznet_wizfi360_evb_pico.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
wiznet_wizfi360_evb_pico.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
wiznet_wizfi360_evb_pico.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=libpicow-ipv6-btc-ble.a
wiznet_wizfi360_evb_pico.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1
wiznet_wizfi360_evb_pico.menu.uploadmethod.default=Default (UF2)
wiznet_wizfi360_evb_pico.menu.uploadmethod.default.build.ram_length=256k
wiznet_wizfi360_evb_pico.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
wiznet_wizfi360_evb_pico.menu.uploadmethod.default.upload.maximum_data_size=262144
wiznet_wizfi360_evb_pico.menu.uploadmethod.default.upload.tool=uf2conv
wiznet_wizfi360_evb_pico.menu.uploadmethod.default.upload.tool.default=uf2conv
wiznet_wizfi360_evb_pico.menu.uploadmethod.default.upload.tool.network=uf2conv-network
wiznet_wizfi360_evb_pico.menu.uploadmethod.picotool=Picotool
wiznet_wizfi360_evb_pico.menu.uploadmethod.picotool.build.ram_length=256k
wiznet_wizfi360_evb_pico.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
wiznet_wizfi360_evb_pico.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
wiznet_wizfi360_evb_pico.menu.uploadmethod.picotool.upload.maximum_data_size=262144
wiznet_wizfi360_evb_pico.menu.uploadmethod.picotool.upload.tool=picotool
wiznet_wizfi360_evb_pico.menu.uploadmethod.picotool.upload.tool.default=picotool
wiznet_wizfi360_evb_pico.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe (CMSIS-DAP)
wiznet_wizfi360_evb_pico.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
wiznet_wizfi360_evb_pico.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
wiznet_wizfi360_evb_pico.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
wiznet_wizfi360_evb_pico.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
wiznet_wizfi360_evb_pico.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
wiznet_wizfi360_evb_pico.menu.uploadmethod.picodebug=Pico-Debug
wiznet_wizfi360_evb_pico.menu.uploadmethod.picodebug.build.ram_length=240k
wiznet_wizfi360_evb_pico.menu.uploadmethod.picodebug.build.debugscript=picodebug.tcl
wiznet_wizfi360_evb_pico.menu.uploadmethod.picodebug.build.picodebugflags=-UUSE_TINYUSB -DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico
wiznet_wizfi360_evb_pico.menu.uploadmethod.picodebug.upload.maximum_data_size=245760
wiznet_wizfi360_evb_pico.menu.uploadmethod.picodebug.upload.tool=picodebug
wiznet_wizfi360_evb_pico.menu.uploadmethod.picodebug.upload.tool.default=picodebug

